package ru.itmo.lessons.course2.Nodes;

public class Paragraphs {
    public static String start = "ЛИСЕНОК\n" +
            "\n" +
            "Каждое утро Лисёнок просыпался, завтракал и шёл увидеться с Бельчонком. Это утро не было исключением. \n" +
            "Лисёнок пришёл на их обычное место встречи, но Бельчонка там не было. Лисёнок ждал, ждал, но так и не смог дождаться своего друга. \n" +
            "\"Бельчонок не пропустил еще ни одной встречи, вдруг он попал в беду\" - подумал Лисёнок. \n" +
            "\n" +
            "Как поступить Лисенку?\n" +
            "\n" +
            "1. Отправиться на поиски\n" +
            "2. Вернуться домой";

    public static String backHome = "ВЕРНУТЬСЯ ДОМОЙ\n" +
            "\n" +
            "Вернувшись домой, Лисёнок нашёл там Бельчонка. \n" +
            "Оказалось, что Бельчонок пришёл на место встречи раньше и увидел там рой злобных пчел. \n" +
            "Он поспешил предупредить об этом Лисёнка, но они разминулись. \n" +
            "Наконец-то друзья нашли друг друга! \n" +
            "\n" +
            "ИГРА ЗАВЕРШИЛАСЬ УСПЕХОМ.";

    public static String search1 = "ОТПРАВИТЬСЯ НА ПОИСКИ\n" +
            "\n" +
            "Все лесные жители были заняты своими делами и не обращали внимания на Лисёнка и его проблему. \n" +
            "Но вдруг кто нибудь видел Бельчонка... Лисёнок не знал, что ему делать. Помогите ему. \n" +
            "\n" +
            "1. Искать Бельчонка в одиночку \n" +
            "2. Попытаться разузнать о Бельчонке у лесных жителей";

    public static String searchAlone = "ИСКАТЬ БЕЛЬЧОНКА В ОДИНОЧКУ\n" +
            "\n" +
            "Лисёнок слишком долго плутал по лесу в поисках друга и сам не заметил, как заблудился. \n" +
            "Теперь его самого нужно искать. \n" +
            "\n" +
            "ИГРА ЗАВЕРШИЛАСЬ НЕУДАЧЕЙ.";

    public static String forestResidents = "ПОПЫТАТЬСЯ РАЗУЗНАТЬ О БЕЛЬЧОНКЕ У ЛЕСНЫХ ЖИТЕЛЕЙ\n" +
            "\n" +
            "Пока Лисёнок принимал решение, лесные жители разошлись кто куда. \n" +
            "Остались только Сова и Волк. \n" +
            "Но у Совы бывают проблемы с памятью, а Волк может сильно разозлиться из-за расспросов. \n" +
            "Кого выбрать?\n" +
            "\n" +
            "1. Расспросить Волка\n" +
            "2. Расспросить Сову";

    public static String askOwl = "РАССПРОСИТЬ СОВУ\n" +
            "\n" +
            "Сова долго не хотела говорить, но в итоге сказала, что видела испуганного Бельчонка, бежавшего вглубь леса. \n" +
            "Все лесные жители знают, что в глубине леса опасно, если Бельчонок там, ему срочно нужна помощь.\n" +
            "\n" +
            "1. Сове не стоит верить\n" +
            "2. Поверить Сове и отправиться вглубь леса";

    public static String askWolf = "РАССПРОСИТЬ ВОЛКА\n" +
            "\n" +
            "Волк оказался вполне дружелюбным, но помочь не смог. \n" +
            "Лишь сказал, что маленькому лисенку не стоит бродить по лесу одному. \n" +
            "И как теперь поступить?\n" +
            "\n" +
            "1. Продолжить поиски\n" +
            "2. Волк прав, нужно вернуться домой";

    public static String trustOwl = "ПОВЕРИТЬ СОВЕ И ОТПРАВИТЬСЯ ВГЛУБЬ ЛЕСА\n" +
            "\n" +
            "В глубине леса Лисёнок встретил Медвежонка. \n" +
            "Ленивый Медвежонок был готов рассказать все, что знает, если Лисёнок принесёт ему мёда.\n" +
            "\n" +
            "1. Нет, потрачено слишком много времени, нужно идти дальше\n" +
            "2. Нужно воспользоваться шансом и раздобыть мёд";

    public static String honeyChance = "НУЖНО ВОСПОЛЬЗОВАТЬСЯ ШАНСОМ И РАЗДОБЫТЬ МЕД\n" +
            "\n" +
            "Лисёнок быстро нашёл мёд, но вокруг летал рой злобных пчел. \n" +
            "Лисёнок всегда боялся пчёл, но и не найти друга он тоже боялся.\n" +
            "\n" +
            "1. Нужно попытаться выкрасть мёд немедленно\n" +
            "2. Подождать, вдруг пчёлы улетят";

    public static String waitBees = "ПОДОЖДАТЬ, ВДРУГ ПЧЕЛЫ УЛЕТЯТ\n" +
            "\n" +
            "Лисёнок подождал немного, и пчёлы разлетелись. \n" +
            "Лисёнок без проблем набрал мёда. Вдруг он понял, что очень голоден. \n" +
            "Что же делать?\n" +
            "\n" +
            "1. Поесть немного и передохнуть\n" +
            "2. Скорее отнести мёд Медвежонку";

    public static String honeyNow = "НУЖНО ПОПЫТАТЬСЯ ВЫКРАСТЬ МЕД НЕМЕДЛЕННО\n" +
            "\n" +
            "Это была не лучшая идея. \n" +
            "Пчёлы покусали Лисёнка, теперь ему самому нужна помощь. \n" +
            "\n" +
            "ИГРА ЗАВЕРШИЛАСЬ НЕУДАЧЕЙ.";

    public static String eatAndRelax = "ПОЕСТЬ НЕМНОГО И ПЕРЕДОХНУТЬ\n" +
            "\n" +
            "Пока Лисёнок ел, злобные пчёлы вернулись и покусали его. \n" +
            "Лисёнку нужна помощь, он не сможет продолжить поиски. \n" +
            "\n" +
            "ИГРА ЗАВЕРШИЛАСЬ НЕУДАЧЕЙ.";

    public static String honeyToBear = "СКОРЕЕ ОТНЕСТИ МЕД МЕДВЕЖОНКУ\n" +
            "\n" +
            "Довольный Медвежонок рассказал Лисёнку, что очень хорошо знает семью Белок и уверен, что Бельчонок никогда не пошёл бы в глубь леса. \n" +
            "Он заверял Лисёнка, что Белки не попадают в неприятности, и что Совам нельзя верить, он также уговаривал Лисёнка вернуться домой.\n" +
            "\n" +
            "1. Медвежонок ничего не знает, нужно продолжить поиски\n" +
            "2. Может быть он прав и Лисёнок просто паникует. Нужно возвращаться";
}
